# LoadTypeBase Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LoadTypeBase Class
Members See Also
---
The base class for LoadTypes
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class LoadTypeBase : ElementType
```

Visual Basic
---
```text
Public Class LoadTypeBase _
	Inherits ElementType
```

Visual C++
---
```text
public ref class LoadTypeBase : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Structure..::..LoadTypeBase Autodesk.Revit.DB.Structure..::..AreaLoadType Autodesk.Revit.DB.Structure..::..LineLoadType Autodesk.Revit.DB.Structure..::..PointLoadType
# See Also
LoadTypeBase Members
Autodesk.Revit.DB.Structure Namespace